In [3]:
import numpy as np
import pandas as pd

分组键只要和数据长度相同就可以

In [6]:
df = pd.DataFrame({'animal':'cat dog cat fish dog cat cat'.split(), 'size':list('SSMMMLL'), 'weight':[8,10,11,1,20,12,12], 'adult':[False]*5+[True]*2})

In [7]:
df

  animal size  weight  adult
0    cat    S       8  False
1    dog    S      10  False
2    cat    M      11  False
3   fish    M       1  False
4    dog    M      20  False
5    cat    L      12   True
6    cat    L      12   True

# 每种动物的平均重量

In [11]:
df.groupby('animal')['weight'].mean()  # 分组后分组键会作为Index

animal
cat     10.75
dog     15.00
fish     1.00
Name: weight, dtype: float64

In [12]:
df.groupby(df.animal)['weight'].sum()

animal
cat     43
dog     30
fish     1
Name: weight, dtype: int64

In [14]:
df.groupby(df.animal).mean()  # 返回能够计算列的数值均值

C:\Users\luhe\AppData\Local\Temp\ipykernel_27024\3372521786.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(df.animal).mean()

        weight  adult
animal
cat      10.75    0.5
dog      15.00    0.0
fish      1.00    0.0

In [15]:
df.groupby(df.animal).mean()['weight']

C:\Users\luhe\AppData\Local\Temp\ipykernel_27024\4204998866.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(df.animal).mean()['weight']

animal
cat     10.75
dog     15.00
fish     1.00
Name: weight, dtype: float64

In [19]:
data = df.groupby(['animal', 'size'])['weight'].mean()  # 根据两列进行分组

In [22]:
data

animal  size
cat     L       12.0
        M       11.0
        S        8.0
dog     M       20.0
        S       10.0
fish    M        1.0
Name: weight, dtype: float64

In [20]:
data.unstack()   # 多重索引变换成dataframe

size       L     M     S
animal
cat     12.0  11.0   8.0
dog      NaN  20.0  10.0
fish     NaN   1.0   NaN

In [23]:
data1 = data.unstack(0)

In [24]:
data1

animal   cat   dog  fish
size
L       12.0   NaN   NaN
M       11.0  20.0   1.0
S        8.0  10.0   NaN

In [26]:
data2 = data1.stack()

In [27]:
data2

size  animal
L     cat       12.0
M     cat       11.0
      dog       20.0
      fish       1.0
S     cat        8.0
      dog       10.0
dtype: float64

In [30]:
data3 = data2.reset_index()  # 将索引转换为数值

In [31]:
data3

  size animal     0
0    L    cat  12.0
1    M    cat  11.0
2    M    dog  20.0
3    M   fish   1.0
4    S    cat   8.0
5    S    dog  10.0

In [32]:
data4 = data3.set_index('animal')

In [33]:
data4

       size     0
animal
cat       L  12.0
cat       M  11.0
dog       M  20.0
fish      M   1.0
cat       S   8.0
dog       S  10.0

In [34]:
data4.index

Index(['cat', 'cat', 'dog', 'fish', 'cat', 'dog'], dtype='object', name='animal')

In [36]:
data4.values

array([['L', 12.0],
       ['M', 11.0],
       ['M', 20.0],
       ['M', 1.0],
       ['S', 8.0],
       ['S', 10.0]], dtype=object)

In [52]:
data4.columns = ['size', 'mean']

In [53]:
data4

       size  mean
animal
cat       L  12.0
cat       M  11.0
dog       M  20.0
fish      M   1.0
cat       S   8.0
dog       S  10.0

In [55]:
data4.rename(columns={'mean':'sum'})

       size   sum
animal
cat       L  12.0
cat       M  11.0
dog       M  20.0
fish      M   1.0
cat       S   8.0
dog       S  10.0

In [56]:
data4.rename(index={'dog':'orange'}, columns={'mean':'sum'})  # index 可重复

       size   sum
animal
cat       L  12.0
cat       M  11.0
orange    M  20.0
fish      M   1.0
cat       S   8.0
orange    S  10.0